dropyourcoffee/poc_Nrf52Lsm6ds3/main.c
    if(c) usb_cmd((char)c);
}

void usb_cmd(char c)
{
    switch(c)
        {
            default:
    			printf("You selected %c\n", (char)c);
                       
    		case '\n':
            case '\r':
                break;
            
    		case '1':
                mpu_init();
                break;
            
    		case '2':
                printf("cmd2 :: readData() = %d\n",readData());
                break;
            case '3':
                printf("cal_get_whole() :: %d\n",cal_get_whole());
                break;
            case '4':
                printf("sampling @ %dHz\n",sampling_counter);
                sampling_counter = 0;
                
                break;
    				
    		case '?':
    			printHelp();
				
        }
}
/** 
 * @}
 */

void printHelp(){
	printf("     COMMAND LIST  \n");
	printf("1 :  Initialise Accel Gyro\n");
	printf("2 :  Get Instantial Data\n");
	printf("? :  Print Command List\n");
						
}
/*
*/

void mpu_init(void){
	printf("mpu init()\n");
	printf("Slave Address : 0x%.4x\n",LSM6DS3_SLAVE_ADDR);
	
	uint8_t rd;
	printf("Testing Connection... ");
	read_register(LSM6DS3_ACC_GYRO_WHO_AM_I_REG,  &rd);
	printf("%s\n", (rd==(LSM6DS3_SLAVE_ADDR-0x2))?"Successful":"Failed" );
	
	uint8_t dataToWrite = 0;
	
	printf("Set Accelerometer..\n");
	dataToWrite |= LSM6DS3_ACC_GYRO_BW_XL_100Hz; // BandWith = 100hz
	dataToWrite |= LSM6DS3_ACC_GYRO_FS_XL_4g;
	dataToWrite |= LSM6DS3_ACC_GYRO_ODR_XL_208Hz;
    // dataToWrite |= LSM6DS3_ACC_GYRO_ODR_XL_13Hz;
    
	write_register(LSM6DS3_ACC_GYRO_CTRL1_XL, dataToWrite);
	
    // dataToWrite = 0;
    // dataToWrite |= LSM6DS3_ACC_GYRO_INT1_DRDY_XL_ENABLED;
    // dataToWrite |= LSM6DS3_ACC_GYRO_INT1_DRDY_G_ENABLED;
    //write_register(LSM6DS3_ACC_GYRO_INT1_CTRL, dataToWrite);

    read_register(LSM6DS3_ACC_GYRO_CTRL4_C,  &rd);
	dataToWrite &= ~((uint8_t)LSM6DS3_ACC_GYRO_BW_SCAL_ODR_ENABLED);
	if(true) dataToWrite |= LSM6DS3_ACC_GYRO_BW_SCAL_ODR_ENABLED; // supposed to be if(settings.accelODRoff)
	write_register(LSM6DS3_ACC_GYRO_CTRL4_C, dataToWrite);
	
	printf("Set Gyrometer..\n");
	dataToWrite = 0;
	dataToWrite |= LSM6DS3_ACC_GYRO_FS_G_2000dps;
	dataToWrite |= LSM6DS3_ACC_GYRO_ODR_G_208Hz;
	write_register(LSM6DS3_ACC_GYRO_CTRL2_G, dataToWrite);
	
	
}
/*
*/
void func2(){
    printf("IS_XL_DRDY: %s\n",is_xl_rdy()? "yes":"no");
}
/*
*/
int is_xl_rdy(){
    uint8_t rd;
    //nrf_delay_us(5000);
    
    read_register(LSM6DS3_ACC_GYRO_STATUS_REG,  &rd);
    // printf("ACC_GYRO_STATUS_REG :: 0x%02x\n",rd);
    return (int)(rd &  LSM6DS3_ACC_GYRO_XLDA_DATA_AVAIL);
    
}



/*
*/
void fifoBegin(){
	
	int threshold = 3000;
	
	uint8_t thresholdLByte = threshold & 0x00FF;
	uint8_t thresholdHByte = (threshold & 0x0F00) >> 8;
	//Pedo bits not configured (ctl2)

	//CONFIGURE FIFO_CTRL3
	uint8_t tempFIFO_CTRL3 = 0;
	
	if (true) // settings.gyroFifoEnabled == 1
	{
		//Set up gyro stuff
		//Build on FIFO_CTRL3
		//Set decimation
		tempFIFO_CTRL3 |= (1 & 0x07) << 3;

	}
	if (true) // settings.accelFifoEnabled == 1
	{
		//Set up accelerometer stuff
		//Build on FIFO_CTRL3
		//Set decimation
		tempFIFO_CTRL3 |= ( 1 & 0x07); // 1 = settings.accelFifoDecimation
	}

	//CONFIGURE FIFO_CTRL4  (nothing for now-- sets data sets 3 and 4
	uint8_t tempFIFO_CTRL4 = 0;

	//CONFIGURE FIFO_CTRL5
	uint8_t tempFIFO_CTRL5 = 0;
	tempFIFO_CTRL5 |= LSM6DS3_ACC_GYRO_ODR_FIFO_10Hz;

	//Hard code the fifo mode here:
	//tempFIFO_CTRL5 |= settings.fifoModeWord = 6;  //set mode:

	//Write the data
	write_register(LSM6DS3_ACC_GYRO_FIFO_CTRL1, thresholdLByte);
	//Serial.println(thresholdLByte, HEX);
	write_register(LSM6DS3_ACC_GYRO_FIFO_CTRL2, thresholdHByte);
	//Serial.println(thresholdHByte, HEX);
	write_register(LSM6DS3_ACC_GYRO_FIFO_CTRL3, tempFIFO_CTRL3);
	write_register(LSM6DS3_ACC_GYRO_FIFO_CTRL4, tempFIFO_CTRL4);
	write_register(LSM6DS3_ACC_GYRO_FIFO_CTRL5, tempFIFO_CTRL5);

}


/*
*/
uint16_t fifoGetStatus(){
	uint8_t tempReadByte = 0;
	uint16_t tempAccumulator = 0;
	read_register(LSM6DS3_ACC_GYRO_FIFO_STATUS1,&tempReadByte);
	tempAccumulator = tempReadByte;
	read_register(LSM6DS3_ACC_GYRO_FIFO_STATUS2,&tempReadByte);
	tempAccumulator |= (tempReadByte << 8);
}

/*
*/
int readData(){
	static int read_en = 1;
    int16_t fifoData = 0;
	uint8_t tempReadByte;
    
    if(is_xl_rdy() == 0){
        read_en = 1;
        return 1;
    }
    
    // Accel x
	if(read_register(LSM6DS3_ACC_GYRO_OUTX_L_XL,&tempReadByte)) return 2;
	fifoData = tempReadByte;
	if(read_register(LSM6DS3_ACC_GYRO_OUTX_H_XL,&tempReadByte)) return 2;
	fifoData |= (tempReadByte << 8);
	
	data.accel.x = (float) fifoData/835.918367;
	
	// Accel y
	if(read_register(LSM6DS3_ACC_GYRO_OUTY_L_XL,&tempReadByte)) return 2;
	fifoData = tempReadByte;
	if(read_register(LSM6DS3_ACC_GYRO_OUTY_H_XL,&tempReadByte)) return 2;
	fifoData |= (tempReadByte << 8);
	
	data.accel.y = (float) fifoData/835.918367;
	
	// Accel z
	if(read_register(LSM6DS3_ACC_GYRO_OUTZ_L_XL,&tempReadByte)) return 2;
	fifoData = tempReadByte;
	if(read_register(LSM6DS3_ACC_GYRO_OUTZ_H_XL,&tempReadByte)) return 2;
	fifoData |= (tempReadByte << 8);
	
	data.accel.z = (float) fifoData/835.918367;
	
	char data_wr[20];
	//sprintf(data_wr,"%2.2f,%2.2f,%2.2f ",data.accel.x, data.accel.y, data.accel.z);
	//printf("accel : %s\n",data_wr);
	ble_nus_string_send(&m_nus, data_wr, 20);
    read_en = 0;
    return 0;
}


static ret_code_t read_register(size_t addr, uint8_t * pdata){
	 ret_code_t ret;
    int i = 0;
		do
    {
       uint8_t addr8 = (uint8_t)addr;
       ret = nrf_drv_twi_tx(&m_twi_master, LSM6DS3_SLAVE_ADDR, &addr8, 1, true);
       if(NRF_SUCCESS != ret)
       {
				 break;
       }
       ret = nrf_drv_twi_rx(&m_twi_master, LSM6DS3_SLAVE_ADDR, pdata,1, false);
			 i++;
    }while(0);
		
    return ret;
}

static ret_code_t write_register(size_t addr, uint8_t pdata)
{
    ret_code_t ret;

#if __DEBUG_PRINT_I2C__
	printf("writing 0x%02x on REG 0x%02x..\n",pdata,addr);
#endif
    do
    {
        uint8_t addr8 = (uint8_t)addr;
        ret = nrf_drv_twi_tx(&m_twi_master, LSM6DS3_SLAVE_ADDR, &addr8, 1, true);
        if(NRF_SUCCESS != ret)
        {
          break;
        }
        ret = nrf_drv_twi_tx(&m_twi_master, LSM6DS3_SLAVE_ADDR, &pdata, 1, false);
    }while(0);
    return ret;
}

ret_code_t I2CwriteBits(uint8_t devAddr, uint8_t regAddr, uint8_t bitStart, uint8_t length, uint8_t data) {

		uint8_t b;
	
    if (read_register(regAddr, &b) != 0) {
        uint8_t mask = ((1 << length) - 1) << (bitStart - length + 1);
        data <<= (bitStart - length + 1); // shift data into correct position
        data &= mask; // zero all non-important bits in data
        b &= ~(mask); // zero all important bits in existing byte
        b |= data; // combine data with existing byte
        return write_register(regAddr, b);
    } else {
        return NRF_ERROR_NULL;
    }
}

ret_code_t I2CwriteBit(uint8_t devAddr, uint8_t regAddr, uint8_t bitNum, uint8_t data) {
    uint8_t b;
    read_register(regAddr, &b);
    b = (data != 0) ? (b | (1 << bitNum)) : (b & ~(1 << bitNum));
    return write_register(regAddr, b);
}



static ret_code_t twi_master_init(void)
{
    ret_code_t ret;
    const nrf_drv_twi_config_t config =
    {
       .scl                = TWI_SCL_M,
       .sda                = TWI_SDA_M,
       .frequency          = NRF_TWI_FREQ_400K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH
    };

    do
    {
        ret = nrf_drv_twi_init(&m_twi_master, &config, NULL);
        if(NRF_SUCCESS != ret)
        {
            break;
        }
        nrf_drv_twi_enable(&m_twi_master);
    }while(0);
    return ret;
}